MOVE ZERO TO WS-COUNTER.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    ADD 1 TO WS-COUNTER
    IF WS-COUNTER > 99999 THEN
        DISPLAY "Counter Overflow!"
        EXIT PERFORM
    END-IF
END-PERFORM.
DISPLAY WS-COUNTER.